---
kind: other
id: Methods.T:Autodesk.Revit.UI.DoubleClickOptions
source: html/013a5466-246b-8c11-0bd8-a9222b51cd99.htm
---
# DoubleClickOptions Methods

Returns the active user's desired action for a particular double-click target.